---
title: ImportFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ImportFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 27
---

# ImportFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ATFContainedUnsupportedGeometricData { get; }` | `ImportFailures.ATFContainedUnsupportedGeometricData` | FailureDefinitionId |
| `FailureDefinitionId ATFNonUniformScalingTransform { get; }` | `ImportFailures.ATFNonUniformScalingTransform` | FailureDefinitionId |
| `FailureDefinitionId BadFaceFoundInDwg { get; }` | `ImportFailures.BadFaceFoundInDwg` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeImportSymbol { get; }` | `ImportFailures.CannotChangeImportSymbol` | FailureDefinitionId |
| `FailureDefinitionId CannotExplodeElement { get; }` | `ImportFailures.CannotExplodeElement` | FailureDefinitionId |
| `FailureDefinitionId CannotImportFile { get; }` | `ImportFailures.CannotImportFile` | FailureDefinitionId |
| `FailureDefinitionId ElementRenamedOnImport { get; }` | `ImportFailures.ElementRenamedOnImport` | FailureDefinitionId |
| `FailureDefinitionId FailedToSetWorkplane { get; }` | `ImportFailures.FailedToSetWorkplane` | FailureDefinitionId |
| `FailureDefinitionId IFCCantUpdateLinkedFile { get; }` | `ImportFailures.IFCCantUpdateLinkedFile` | FailureDefinitionId |
| `FailureDefinitionId IFCGenericImportWarning { get; }` | `ImportFailures.IFCGenericImportWarning` | FailureDefinitionId |
| `FailureDefinitionId IFCGenericRevitImportWarning { get; }` | `ImportFailures.IFCGenericRevitImportWarning` | FailureDefinitionId |
| `FailureDefinitionId IFCPartialSchemaSupport { get; }` | `ImportFailures.IFCPartialSchemaSupport` | FailureDefinitionId |
| `FailureDefinitionId ImportedModelIsEmpty { get; }` | `ImportFailures.ImportedModelIsEmpty` | FailureDefinitionId |
| `FailureDefinitionId ImportedModelWithDifferentLengthUnits { get; }` | `ImportFailures.ImportedModelWithDifferentLengthUnits` | FailureDefinitionId |
| `FailureDefinitionId ImportModelOutOfRange { get; }` | `ImportFailures.ImportModelOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId ImportModelTooLarge { get; }` | `ImportFailures.ImportModelTooLarge` | FailureDefinitionId |
| `FailureDefinitionId ImportScaleTooLarge { get; }` | `ImportFailures.ImportScaleTooLarge` | FailureDefinitionId |
| `FailureDefinitionId ImportSymbolBaseLevelInvalid { get; }` | `ImportFailures.ImportSymbolBaseLevelInvalid` | FailureDefinitionId |
| `FailureDefinitionId ImportTooFarAway { get; }` | `ImportFailures.ImportTooFarAway` | FailureDefinitionId |
| `FailureDefinitionId ImportTooManyElmentsToExplode { get; }` | `ImportFailures.ImportTooManyElmentsToExplode` | FailureDefinitionId |
| `FailureDefinitionId LevelRenamedOnImport { get; }` | `ImportFailures.LevelRenamedOnImport` | FailureDefinitionId |
| `FailureDefinitionId LostAcisObjectsOnImport { get; }` | `ImportFailures.LostAcisObjectsOnImport` | FailureDefinitionId |
| `FailureDefinitionId SomeObjectsNotExploded { get; }` | `ImportFailures.SomeObjectsNotExploded` | FailureDefinitionId |
| `FailureDefinitionId TextNotImported { get; }` | `ImportFailures.TextNotImported` | FailureDefinitionId |
| `FailureDefinitionId TooManyPickFaces { get; }` | `ImportFailures.TooManyPickFaces` | FailureDefinitionId |
| `FailureDefinitionId ViewDoesNotSupportCenterToCenter { get; }` | `ImportFailures.ViewDoesNotSupportCenterToCenter` | FailureDefinitionId |
| `FailureDefinitionId WorksetCreatedForLinkWarning { get; }` | `ImportFailures.WorksetCreatedForLinkWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```